Repository: Diego863/script-to-package-tool-for-macos
Catalog: Script2Pkg/*.lproj/Localizable.strings
Languages: de

# credentialsDialogText
source: Please sign in using an Apple ID associated with development team %@ and the app-specific password you have created for notarization.
de: Bitte melden Sie sich mit einer Apple ID, die dem Entwicklerteam %@ zugeordnet ist, und dem App-spezifischen Passwort, welches Sie für die Beglaubigung von Paketen angelegt haben, an.

# mainWindowDefaultText
source: at the script's location
de: am selben Speicherort wie das Skript

# mainWindowAlternateText
source: at the location you have chosen in this app's settings
de: an dem Speicherort, den Sie in den Einstellungen dieses Programms ausgwählt haben

# selectButton
source: Select
de: Auswählen

# buildButton
source: Build
de: Erstellen

# validateButton
source: Validate
de: Überprüfen

# cancelButton
source: Cancel
de: Abbrechen

# invalidateButton
source: Invalidate
de: Verwerfen

# showWindowButton
source: Show activity window…
de: Aktivitätsfenster anzeigen…

# openDialogMessage
source: Please select one or more scripts and click the "Build" button below to create a package from each script you selected.
de: Bitte wählen Sie ein oder mehrere Skripte aus und klicken Sie anschließend auf die Taste "Erstellen", um für jedes ausgewählte Skript ein Paket zu erstellen.

# validateDialogMessage
source: Please select a package and click the "Validate" button below to check the signature of the package.
de: Bitte wählen Sie ein Paket aus und klicken Sie anschließend auf die Taste "Überprüfen", um die Signatur des Pakets zu überprüfen.

# notarytoolMissingTooltip
source: This checkbox is disabled because the notarytool command line tool has not been found. Please install the Command Line Tools for Xcode 13 or later to get notarytool and enable notarization.
de: Dieses Kontrollkästchen ist deaktiviert, weil das notarytool Kommandozeilentool nicht gefunden wurde. Bitte installieren Sie die Kommandozeilentools für Xcode 13 oder höher, um notarytool zu erhalten und aktivieren Sie anschließend die Beglaubigung von Paketen.

# signingDisabledTooltip
source: This checkbox is disabled because package signing is disabled and only signed packages may be notarized.
de: Dieses Kontrollkästchen ist deaktiviert, weil das Signieren von Paketen deaktiviert ist und nur signierte Pakete beglaubigt werden können.

# noSigningIdentityTooltip
source: This checkbox is disabled because no valid code signing identity has been found in your login keychain.
de: Dieses Kontrollkästchen ist deaktiviert, weil keine geeignete Signatur in Ihrem Anmeldeschlüsselbund gefunden wurde.

# commandLineToolsInstalledText
source: To notarize packages, Xcode 13, the Command Line Tools for Xcode 13, or later versions of these tools are required. Compatible versions of these tools have been detected as being installed, so notarizing should work as expected.
de: Um Pakete beglaubigen lassen zu können, sind Xcode 13, die Kommandozeilentools für Xcode 13, oder neuere Versionen dieser Programme notwendig. Die notwendige Software ist auf diesem Mac bereits installiert, sodass die Beglaubigung von Paketen problemlos funktionieren sollte.

# stoppingProgressLabel
source: Stopping…
de: Abbrechen …

# errorMessageTitle
source: Errors occurred while building packages.
de: Während der Paketerstellung sind Fehler aufgetreten.

# errorMessageText
source: Please check the activity window for details.
de: Bitte öffnen Sie das Aktivitätsfenster um Details zu erhalten.

# invalidateCredentialsMessageTitle
source: Are you sure you want to invalidate the stored credentials?
de: Sind Sie sicher, dass Sie die gespeicherten Zugangsdaten verwerfen wollen?

# invalidateCredentialsMessageText
source: Invalidating credentials also disables notarization. You may re-enable notarization at any time, but you must provide valid credentials then.
de: Dies deaktiviert temporär die Beglaubigung von Paketen. Sie können die Beglaubigung jederzeit wieder aktivieren, müssen dann jedoch die entsprechenden Zugangsdaten neu eingeben.

# packageSuccessNotificationTitle
source: Packaging successful!
de: Paketerstellung erfolgreich!

# packageSuccessNotificationMessage
source: The package "%@" has been successfully built.
de: Das Paket "%@" wurde erfolgreich erstellt.

# packageFailNotificationTitle
source: Packaging failed!
de: Paketerstellung fehlgeschlagen!

# packageFailNotificationMessage
source: The package "%@" could not be built.
de: Das Paket "%@" konnte nicht erstellt werden.

# MTPackagingTaskState_0
source: Waiting
de: Warte

# MTPackagingTaskState_1
source: Building package
de: Paket wird erzeugt

# MTPackagingTaskState_2
source: Notarizing package
de: Paket wird beglaubigt

# MTPackagingTaskState_3
source: Copying package
de: Paket wird kopiert

# MTPackagingTaskState_4
source: Failed to build package
de: Paketerstellung fehlgeschlagen

# MTPackagingTaskState_5
source: Failed to notarize package
de: Beglaubigung des Pakets fehlgeschlagen

# MTPackagingTaskState_6
source: Failed to copy package
de: Kopieren des Pakets fehlgeschlagen

# MTPackagingTaskState_7
source: Cancelled
de: Abgebrochen

# MTPackagingTaskState_8
source: Complete
de: Fertig

# pkgSignedBy
source: This package was signed by "%@".
de: Dieses Paket wurde signiert von "%@".

# pkgNotSigned
source: This package is not signed.
de: Dieses Paket ist nicht signiert.

# pkgIsNotarized
source: This package was notarized by Apple.
de: Dieses Paket wurde von Apple beglaubigt.

# pkgNotNotarized
source: This package is not notarized.
de: Dieses Paket ist nicht beglaubigt.

# pkgByApple
source: This package was created and signed by Apple.
de: Dieses Paket wurde von Apple erstellt und signiert.

# pkgExpired
source: This package is signed using a certificate that has since expired.
de: Dieses Paket ist mit einem abgelaufenen Zertifikat signiert.

# pkgNotSignedDescription
source: This package is not signed with a digital certificate and is not trusted by Apple's notarization service. On Macs with Apple's Gatekeeper security feature enabled, installation of the package may be blocked because Apple's built-in security tools can't verify that it doesn't contain malware.
de: Dieses Paket wurde weder mit einem digitalen Zertifikat signiert, noch wurde sie von Apple beglaubigt. Auf Macs, auf denen Apples Gatekeeper Sicherheitsfeature aktiviert ist, wird die Installation nicht möglich sein, weil macOS nicht überprüfen kann, ob das Paket Schadsoftware enthält.

# pkgIsSignedDescription
source: This package is signed with a digital certificate, but is not trusted by Apple's notarization service. If a user tries to install this package on Macs with Apple's Gatekeeper security feature enabled, macOS may warn the user because of the missing notarization. The user may be able to acknowledge this warning and successfully install the package.
de: Dieses Paket wurde mit einem digitalen Zertifikat signiert, aber nicht von Apple beglaubigt. Auf Macs, auf denen Apples Gatekeeper Sicherheitsfeature aktiviert ist, wird eine Warnung erscheinen. Wird diese Warnung akzeptiert, sollte sich das Paket problemlos installieren lassen.

# pkgIsNotarizedDescription
source: This package is signed with a digital certificate and trusted by Apple's notarization service. A user should be able to install this package without any problems.
de: Dieses Paket wurde mit einem digitalen Zertifikat signiert und von Apple beglaubigt. Es sollte sich problemlos installieren lassen.

# pkgExpiredDescription
source: The signature of this package has been expired. On Macs with Apple's Gatekeeper security feature enabled, installation of the package may be blocked.
de: Die Signatur dieses Pakets ist abgelaufen. Auf Macs, auf denen Apples Gatekeeper Sicherheitsfeature aktiviert ist, wird die Installation nicht möglich sein.
